{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "schedule_meeting",
    "1": "send_email",
    "2": "check_calendar",
    "3": "cancel_meeting",
    "4": "add_reminder",
    "5": "check_reminders",
    "6": "send_message",
    "7": "general_query"
  },
  "initializer_range": 0.02,
  "label2id": {
    "add_reminder": 4,
    "cancel_meeting": 3,
    "check_calendar": 2,
    "check_reminders": 5,
    "general_query": 7,
    "schedule_meeting": 0,
    "send_email": 1,
    "send_message": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.1",
  "vocab_size": 30522
}
